L='left service'
def os_(d): return 'Оставилъ службу '+d
S=[
("musicians_1896-97_MSK_p001","Дмитріева","28.",dict(add="Оставила службу 1 августа 1896 г.",end=("1 августа 1896 г.",L))),
("musicians_1898-99_MSK_p002","Триньякъ","99.",dict(add=os_("1 октября 1898 г."),end=("1 октября 1898 г.",L))),
("musicians_1898-99_SP_p002","Келеръ","50.",dict(add="Переведенъ на мѣсто капельмейстера Михайловскаго театра 1 декабря 1898 г.")),
("musicians_1898-99_MSK_p001","Нальхановъ",None,dict(sub=("октѣбря","октября"))),
("musicians_1899-00_MSK_p004","Николаевъ","21.",dict(replace=("съ 23 сентября 1898 г.","(Шмулевичъ) съ 23 сентября 1898 г."))),
("musicians_1899-00_MSK_p004","Фарскій","29.",dict(replace=("съ 1 января 1894 г.","(онъ же и библіотекарь Музыкальной библіотеки) съ 1 января 1894 г."))),
]
